#coding:utf-8
'''
思考：1.有四个数，相加等于45，分别去+2 -2 *2 /2得到的结果相等i，求这四个数
    a+b+c+d=45
    a+2=b-2=c*2=d/2=i


for i in range(90):
    #在循环里，i是已知数
    a = i+2
    b = i-2
    c = i*2
    d = i/2
    if(a+b+c+d==45):
        print('这四个数是',a,b,c,int(d))
'''  
'''
    2.买鸡问题，你有100块钱，公鸡5块钱一只，母鸡3块钱一只，小鸡一块钱3只，钱花光
        分别写出买的方法(公鸡买了20只，母鸡买了0只，小鸡买了0只)
        求出共有多少种买法

count = 0#保存买法数量的变量
for g in range(21):
    #公鸡的数量就是已知数
    for m in range(34):
        #母鸡的数量就是已知数
        x = (100 - 5*g -3*m)*3  #小鸡的数量算出来
        if(x>=0):
            print('公鸡',g,'母鸡',m,'小鸡',x)
            count = count + 1#每次成立都加1
print('共有',count,'种买法。')
'''
'''
有36个物品，有36个人，成年男子一次搬4个，成年女子一次搬3个，两个小孩搬1个，一次搬完，各有多少人

for i in range(1,9):
    for j in range(1,12):
        k= 36-i-j#小孩的数量
        if(i*4+j*3+k/2==36):
            print('男人',i,'女人',j,'小孩',k)
'''

#使用for循环求1-100以内偶数的和
#仓库思想
s = 0#存放总和
for i in range(1,101):
    if(i%2==0):
        s = s+i
print('1-100以内偶数的和为',s)
for m in range(5):
    for n in range(5):
        #print结尾会有一个/n,end=''，结尾放一个空字符
        print(n,end='')
    print()










    