### 保存现场

+ 无论是通过快速调用还是中断门进零环，三环的寄存器都会放在 `_Trap_Frame` 这个结构体里面。

+ `KPCR` 是CPU控制区，每一个核有一个KPCR，查看核的数量

  ![image-20210131134846608](https://raw.githubusercontent.com/smallzhong/picgo-pic-bed/master/image-20210131134846608.png)

  查看KPCR

  ![image-20210131134910778](https://raw.githubusercontent.com/smallzhong/picgo-pic-bed/master/image-20210131134910778.png)

+ `fs.base = ffdff000` ，指向当前CPU的 `KPCR` 结构。

  ```cpp
  nt!_KPCR
     +0x000 NtTib            : _NT_TIB
     +0x01c SelfPcr          : Ptr32 _KPCR
     +0x020 Prcb             : Ptr32 _KPRCB
     +0x024 Irql             : UChar
     +0x028 IRR              : Uint4B
     +0x02c IrrActive        : Uint4B
     +0x030 IDR              : Uint4B
     +0x034 KdVersionBlock   : Ptr32 Void
     +0x038 IDT              : Ptr32 _KIDTENTRY
     +0x03c GDT              : Ptr32 _KGDTENTRY
     +0x040 TSS              : Ptr32 _KTSS
     +0x044 MajorVersion     : Uint2B
     +0x046 MinorVersion     : Uint2B
     +0x048 SetMember        : Uint4B
     +0x04c StallScaleFactor : Uint4B
     +0x050 DebugActive      : UChar
     +0x051 Number           : UChar
     +0x052 Spare0           : UChar
     +0x053 SecondLevelCacheAssociativity : UChar
     +0x054 VdmAlert         : Uint4B
     +0x058 KernelReserved   : [14] Uint4B
     +0x090 SecondLevelCacheSize : Uint4B
     +0x094 HalReserved      : [16] Uint4B
     +0x0d4 InterruptMode    : Uint4B
     +0x0d8 Spare1           : UChar
     +0x0dc KernelReserved2  : [17] Uint4B
     +0x120 PrcbData         : _KPRCB
  ```

+ 对 `ffdf0000` 和 `7ffe0000` 要足够敏感，知道这两个地址分别是三环和零环访问 `_KUSER_SHARED_DATA`  的地址。